FKDD_COPY_DIFF_3_2026-02-14/DataProcessors/АвтозаполнениеЯчеистогоСклада.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>АвтозаполнениеЯчеистогоСклада</Name>
			<Comment>Автозаполнение ячеистого склада</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Comment>Склад</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтратегияЗаполнения</Name>
					<Comment>1 - от введенного количества ячеек, 2 - от размеров склада</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОткрытаИзОбъекта</Name>
					<Comment>Признак того что обработка открыта из другого объекта</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШиринаЯчейки</Name>
					<Comment>Стандартная ширина ячеек для расчета количества</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлинаЯчейки</Name>
					<Comment>Стандартная длина ячеек для расчета количества</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧислоЯчеек</Name>
					<Comment>Число ячеек в ряду</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧислоРядов</Name>
					<Comment>Число рядов ячеек</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Зазор</Name>
					<Comment>Зазор между ячейками</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Catalogs/ЯчейкиХранения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЯчейкиХранения</Name>
			<Comment>Места хранения ячеистого склад</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.СкладыКомпании</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДлинаЯчейки</Name>
					<Comment>Длина ячейки в единицах размерности склада-владельца</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШиринаЯчейки</Name>
					<Comment>Ширина ячейки в единицах размерности склада-владельца</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоординатаX</Name>
					<Comment>Координата X ячейки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоординатаY</Name>
					<Comment>Координата Y ячейки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Уровень</Name>
					<Comment>Координата Z ячейки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветГруппы</Name>
					<Comment>Цвет ячеек, входящих в данную группу, для отображения в карте склада. </Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недоступна</Name>
					<Comment>Признак доступности (активности ) ячейки. Например, ячейка недоступна, если она сломана, красится и т.д.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/DataProcessors/АвтозаполнениеЯчеистогоСклада/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА


////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

// Рассчитаем размеры ячеек, исходя из указанного количества и размеров склада
//
// Возвращаемое значение:
//    Структура - СредняяДлинаЯчейки, СредняяШиринаЯчейки
//
Функция РассчитатьРазмерыЯчейки() Экспорт
	// Округляем в меньшую сторону, чтобы ячейки не "вылезли" за пределы склада
	СредняяДлинаЯчейки  = ?(ЧислоЯчеек > 0, Окр((Склад.ДлинаСклада  + Зазор) / (ЧислоЯчеек + Зазор), 2, РежимОкругления.Окр15как10), 0);  
	СредняяШиринаЯчейки = ?(ЧислоРядов > 0, Окр((Склад.ШиринаСклада + Зазор) / (ЧислоРядов + Зазор), 2, РежимОкругления.Окр15как10), 0);  
	СтруктураРазмеры = Новый Структура ("СредняяДлинаЯчейки, СредняяШиринаЯчейки",СредняяДлинаЯчейки,СредняяШиринаЯчейки);
	Возврат СтруктураРазмеры;
КонецФункции // РассчитатьРазмерыЯчейки()

// Рассчитаем количество ячеек, исходя из указанных размеров ячеек и склада
//
// Возвращаемое значение:
//    Структура 	- КоличествоЯчеек, КоличествоРядов
//
Функция РассчитатьКоличествоЯчеек() Экспорт
	// длину склада мы увеличиваем на величину зазора, поскольку зазоры между крайними ячейками и
	// "стенками" склада мы не учитываем
	КоличествоЯчеек = ?(ДлинаЯчейки  > 0, Цел((Склад.ДлинаСклада  + Зазор) / (ДлинаЯчейки  + Зазор)), 0);  
	КоличествоРядов = ?(ШиринаЯчейки > 0, Цел((Склад.ШиринаСклада + Зазор) / (ШиринаЯчейки + Зазор)), 0);  
	СтруктураКоличество = Новый Структура ("КоличествоЯчеек, КоличествоРядов",КоличествоЯчеек,КоличествоРядов);
	Возврат СтруктураКоличество;
КонецФункции // РассчитатьКоличествоЯчеек()

// Процедура заполнения выбранного склада ячейками
//
// Параметры:
//    НЕТ
//
Процедура СоздатьЯчейки() Экспорт
	Если СтратегияЗаполнения = 1 Тогда
		СтруктураКоличество = РассчитатьКоличествоЯчеек();
		// Создадим нужно количество ячеек
		НачатьТранзакцию();
		ОбщееКоличество = СтруктураКоличество.КоличествоЯчеек * СтруктураКоличество.КоличествоРядов * Склад.ЧислоУровней;
		Счетчик = 0;
		СтарЗначение = 0;
		Прогресс = 0;
		#Если Клиент Тогда
		Состояние("Выполнено: 0%");
		#КонецЕсли
		// координаты x, y и z начинаются с нуля
		Для x = 0 По СтруктураКоличество.КоличествоЯчеек - 1 Цикл
			Для y = 0 По СтруктураКоличество.КоличествоРядов -1 Цикл
				Для z = 0 По Склад.ЧислоУровней-1 Цикл
					НовыйЭлемент = Справочники.ЯчейкиХранения.СоздатьЭлемент();
					НовыйЭлемент.Владелец = Склад;			
					НовыйЭлемент.КоординатаX = x;
					НовыйЭлемент.КоординатаY = y;
					НовыйЭлемент.КоординатаX = x * (ДлинаЯчейки  + Зазор);
					НовыйЭлемент.КоординатаY = y * (ШиринаЯчейки + Зазор);
					НовыйЭлемент.Уровень 	 = z;
					НовыйЭлемент.ДлинаЯчейки	 = ДлинаЯчейки;
					НовыйЭлемент.ШиринаЯчейки 	 = ШиринаЯчейки;
					НовыйЭлемент.Недоступна  = Ложь;
					НовыйЭлемент.Код = "" + (x+1) + "-" + (y+1) + "-" + (z);
					НовыйЭлемент.Записать();
					#Если Клиент Тогда
					ОбработкаПрерыванияПользователя();
					Счетчик = Счетчик + 1;
					Прогресс = Цел(Счетчик * 100 / ОбщееКоличество);
					Если Прогресс <> СтарЗначение Тогда
						Состояние("Выполнено: " + Прогресс + "%");
					    СтарЗначение = Прогресс;
					КонецЕсли; 
					#КонецЕсли
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	ИначеЕсли СтратегияЗаполнения = 2 Тогда	
		РазмерыЯчейки = РассчитатьРазмерыЯчейки();
		// Создадим нужное количество ячеек
		НачатьТранзакцию();
		ОбщееКоличество = ЧислоЯчеек * ЧислоРядов * Склад.ЧислоУровней;
		Счетчик = 0;
		СтарЗначение = 0;
		#Если Клиент Тогда
		Состояние("Выполнено: 0%");
		#КонецЕсли
		// координаты x, y и z начинаются с нуля
		Для x = 0 По ЧислоЯчеек - 1 Цикл
			Для y = 0 По ЧислоРядов - 1 Цикл
				Для z = 0 По Склад.ЧислоУровней-1 Цикл
					НовыйЭлемент = Справочники.ЯчейкиХранения.СоздатьЭлемент();
					НовыйЭлемент.Владелец = Склад;			
					НовыйЭлемент.КоординатаX = x * (РазмерыЯчейки.СредняяДлинаЯчейки  + Зазор);
					НовыйЭлемент.КоординатаY = y * (РазмерыЯчейки.СредняяШиринаЯчейки + Зазор);
					НовыйЭлемент.Уровень 	 = z;
					НовыйЭлемент.ДлинаЯчейки	 = РазмерыЯчейки.СредняяДлинаЯчейки;
					НовыйЭлемент.ШиринаЯчейки 	 = РазмерыЯчейки.СредняяШиринаЯчейки;
					НовыйЭлемент.Недоступна  = Ложь;
					НовыйЭлемент.Код = "" + (x+1) + "-" + (y+1) + "-" + (z);
					НовыйЭлемент.Записать();
					#Если Клиент Тогда
					ОбработкаПрерыванияПользователя();
					Счетчик = Счетчик + 1;
					Прогресс = Цел(Счетчик * 100 / ОбщееКоличество);
					Если Прогресс <> СтарЗначение Тогда
						Состояние("Выполнено: " + Прогресс + "%");
					    СтарЗначение = Прогресс;
					КонецЕсли; 
					#КонецЕсли
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	КонецЕсли; 
	
КонецПроцедуры // СоздатьЯчейки()

////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ
